def convert(sen):
    dic = {'CC': '并列连词', 'CD': '基数词', 'DT': '限定词', 'EX': 'there be句型中的引导词', 'FW': '外来词', 'IN': '介词', 'JJ': '形容词',
           'JJR': '形容词（比较级）', 'JJS': '形容词（最高级）', 'LS': '列表项目标记', 'MD': '情态动词', 'NN': '名词（单数）', 'NNS': '名词（复数）'
        , 'NNP': '专有名词（单数）', 'NNPS': '专有名词（复数）', 'PDT': '前置限定词', 'POS': '所有格结束词', 'PRP': '人称代词', 'PRP$': '所有格代词',
           'RB': '副词', 'RBR': '副词（比较级）', 'RBS': '副词（最高级）', 'RP': '小品词', 'SYM': '科学符号', 'TO': '介词'
        , 'UH': '感叹词', 'VB': '动词', 'VBD': '动词（过去式）', 'VBG': '动词（动名词或现在分词）', 'VBN': '动词（过去分词）', 'VBP': '动词（非第三人称单数现在时）',
           'VBZ': '动词（第三人称单数现在时）', 'WDT': '疑问词', 'WP': '疑问词', 'WP$': '疑问词', 'WRB': '疑问词'}

    result = []
    for i in sen:
        result.append((i[0], dic[i[1]]))

    return result